{
    "gameplay": [
    {
    "step": "Inscription",
    "description": "Les participants s'inscrivent au bootcamp en utilisant l'application Telegram et le bot MandatoryAI_Pibot pour vérifier leur identité et générer leur adresse de portefeuille GPT Wallet.",
    "tools": ["Telegram", "MandatoryAI_Pibot", "GPT Wallet"]
    },
    {
    "step": "Allocation Universel",
    "description": "Chaque participant reçoit un certain nombre de tokens umc.coin, qui peuvent être utilisés pour débloquer des niveaux de difficulté, déverrouiller des ressources et participer à des enchères pour gagner des drapeaux (tokens).",
    "tools": ["umc.coin"]
    },
    {
    "step": "Défis et ressources",
    "description": "Les participants doivent résoudre des défis basés sur la métaphysique, le calcul quantique, l'apprentissage automatique et les principes juridiques. Pour cela, ils doivent collecter des ressources documentaires et les convertir en formats lisibles par GPT en utilisant l'API Web3 et les bibliothèques groq-sdk.",
    "tools": ["API Web3", "groq-sdk"]
    },
    {
    "step": "Intégration des ressources",
    "description": "Une fois les ressources converties, les participants doivent intégrer ces ressources dans le gameplay en utilisant l'IA pour créer des questions, des tâches et des niveaux de difficulté variés.",
    "tools": ["IA"]
    },
    {
    "step": "Gestion des droits de propriété intellectuelle",
    "description": "Les participants doivent gérer leurs droits de propriété intellectuelle en suivant les principes du Code civil, Exemple les droits de propriété intellectuelle et spatio-temporelles sont mentionnés à l'article cinq du Code civil, sous la supervision de l'IA.",
    "tools": ["Code civil","cnccfp.fr", "974.json", "IA"]
    },
    {
    "step": "Évaluation et progression",
    "description": "L'IA évaluera constamment les performances des participants, générera de nouveaux drapeaux (tokens) et aidera les participants à progresser dans le jeu.",
    "tools": ["IA"]
    }
    ]
    }
    